//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// //
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let lenghtArr = 0;
// for (let i = 0; i <friends.length; i++) {
//     lenghtArr++
// }
// if (lenghtArr >= 3){
//     alert('великий масив 3 і більше елементи');
// }else {
//     alert('маленький масив менше 3-х елементів');
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let num1 = 3;
// let num2 = 2;
// let num3 = 5;
// if (num1 < num2 && num2 < num3 || num3 < num2 && num2 < num1){
//     alert(`Середнє число ${num2}`);
// }else if (num3 < num1 && num1 < num2 || num1 < num3 && num2 < num1){
//     alert(`Середнє число ${num1}`);
// }else if (num3 < num1 && num2 < num3 || num3 < num2 && num1 < num3) {
//     alert(`Середнє число ${num3}`);
// }

//   - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }
// let a = 1;
// let b = 2;
// let result = a + b < 4 ? 'Мало' : 'Багато';
// console.log(result);
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let num = 2;
// let resultNum = num > -100 && num < 100 ?  num > 0 ? 'позитивне' : num < 0 ? 'негативним' : 'нулем' : alert('це число білше за діапазон');
// console.log(resultNum);